## Using Python to Integrate MongoDB Data into an ETL Process
Modern Data Warehousing and Analytics solutions frequently use languages like Python or Scala to extract data from numerous sources, including relational database management systems, NoSQL database systems, real-time streaming endpoints and Data Lakes. These languages can then be used to perform many types of transformation before then loading the data into a variety of destinations including file systems and data warehouses. This data can then be consumed by data scientists or business analysts.

In this lab you will build upon the **Northwind_DW2** dimensional database from Lab 3; however, you will be integrating new data sourced from an instance of MongoDB. The new data will be concerned with new business processes; inventory and purchasing. You will continue to interact with both the source systems (MongoDB and MySQL), and the destination system (the Northwind_DW2 data warehouse) from a remote client running Python (Jupyter Notebooks). 

Just as in Lab 3, you will fetch data into Pandas DataFrames, perform all the necessary transformations in-memory on the client, and then push the newly transformed DataFrame to the RDBMS data warehouse using a Pandas function that will create the table and fill it with data with a single operation.

### Prerequisites:
This notebook uses the PyMongo database connectivity library to connect to MySQL databases; therefore, you must have first installed that libary into your python environment by executing the following command in a Terminal window.

- `python -m pip install pymongo[srv]`

#### Import the Necessary Libraries

In [1]:
import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine

In [2]:
print(f"Running SQL Alchemy Version: {sqlalchemy.__version__}")
print(f"Running PyMongo Version: {pymongo.__version__}")

Running SQL Alchemy Version: 1.4.39
Running PyMongo Version: 4.6.2

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [3]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_hostname = "localhost"

atlas_cluster_name = "cluster_name.xxxxx"
atlas_user_name = ""
atlas_password = "password"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "northwind_purchasing"
dst_dbname = "northwind_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://jtupitza:Passw0rd1234@sandbox.zibbf.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [4]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [5]:
client = pymongo.MongoClient(conn_str["atlas"], tlsCAFile=certifi.where())
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"suppliers" : 'northwind_suppliers.json',
              "invoices" : 'northwind_invoices.json',
              "purchase_orders" : 'northwind_purchase_orders.json',
              "inventory_transactions" : 'northwind_inventory_transactions.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### 1.0. Create and Populate the New Dimension Tables
#### 1.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [6]:
query = {} # Select all elements (columns), and all documents (rows).
collection = "invoices"

df_invoices = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_invoices.head(2)

   id  order_id         invoice_date due_date  tax  shipping  amount_due
0   5        31  2006-03-22 16:08:59     None  0.0       0.0         0.0
1   6        32  2006-03-22 16:10:27     None  0.0       0.0         0.0

In [7]:
# TODO: Extract data from the "Suppliers" collection

   id     company last_name    first_name      job_title
0   1  Supplier A  Andersen  Elizabeth A.  Sales Manager
1   2  Supplier B    Weiler      Cornelia  Sales Manager

#### 1.2. Lookup the Invoice Date Keys from the Date Dimension Table.
Here we see an example of where a dimension cross-references another dimension; the Date dimension.  The Date dimension is a classic example of a **Role-Playing dimension**. Dates in-and-of themselves are universal; however, when applied to specific events they take on the identity of those events. Here, the *dim_date* table takes on the identity of *dim_invoice_date* to supply invoice date keys to the *dim_invoices* table.

##### 1.2.1. Get the Data from the Date Dimension Table.
First, fetch the Surrogate Primary Key (date_key) and the Business Key (full_date) from the Date Dimension table using the **get_sql_dataframe()** function. Be certain to cast the **full_date** column to the **datetime64[ns]** data type using the **.astype()** function that is native to Pandas DataFrame columns. Also, extract the **date** portion using the **.dt.date** attribute of the **datetime64[ns]** datatype.

In [8]:
sql_dim_date = "SELECT date_key, full_date FROM northwind_dw2.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64[ns]').dt.date
df_dim_date.head(2)

   date_key   full_date
0  20000101  2000-01-01
1  20000102  2000-01-02

##### 1.2.2. Lookup the Surrogate Primary Key (date_key) that Corresponds to the invoice_date Column

In [9]:
df_dim_invoice_date = df_dim_date.rename(columns={"date_key" : "invoice_date_key", "full_date" : "invoice_date"})
df_invoices.invoice_date = df_invoices.invoice_date.astype('datetime64[ns]').dt.date
df_invoices = pd.merge(df_invoices, df_dim_invoice_date, on='invoice_date', how='left')
df_invoices.drop(['invoice_date'], axis=1, inplace=True)
df_invoices.head(2)

   id  order_id due_date  tax  shipping  amount_due  invoice_date_key
0   5        31     None  0.0       0.0         0.0          20060322
1   6        32     None  0.0       0.0         0.0          20060322

#### 1.3. Perform Any Necessary Transformations to the DataFrames

In [10]:
# 1. Rename the "id" column to reflect the entity as it will serve as the business key for lookup operations
df_invoices.rename(columns={"id":"invoice_id"}, inplace=True)

# 2. Since there are no values in the 'due_date' column go ahead and drop it.
df_invoices.drop(['due_date'], axis=1, inplace=True)

# 3. Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df_invoices.insert(0, "invoice_key", range(1, df_invoices.shape[0]+1))
df_invoices.head(2)

,invoice_key,invoice_id,order_id,tax,shipping,amount_due,invoice_date_key
0,1,5,31,0.0,0.0,0.0,20060322
1,2,6,32,0.0,0.0,0.0,20060322

In [11]:
# 1. Rename the "id" column to reflect the entity as it will serve as the business key for lookup operations


# 2. Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.

df_suppliers.head(2)

,supplier_key,supplier_id,company,last_name,first_name,job_title
0,1,1,Supplier A,Andersen,Elizabeth A.,Sales Manager
1,2,2,Supplier B,Weiler,Cornelia,Sales Manager

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

Here we will call our **set_dataframe( )** function to create each dimension table. This function expects a number of parameters including the usual connection information (e.g., user_id, password, MySQL server name and database), the *table_name* we need to assign to the table, the *pandas DataFrame* we crafted to define & populate the table, the *name* of the column we wish to designate as the *primary_key* column, and finally, the database operation (insert or update).

In [13]:
dataframe = df_invoices
table_name = 'dim_invoices'
primary_key = 'invoice_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [12]:
# TODO: Upload the "Suppliers" dataframe to create the new "dim_suppliers" dimension table

#### 1.4. Validate that the New Dimension Tables were Created.

In [14]:
sql_invoices = "SELECT * FROM northwind_dw2.dim_invoices;"
df_dim_invoices = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_invoices)
df_dim_invoices.head(2)

,invoice_key,invoice_id,order_id,tax,shipping,amount_due,invoice_date_key
0,1,5,31,0.0,0.0,0.0,20060322
1,2,6,32,0.0,0.0,0.0,20060322

In [15]:
# TODO: Validate the new "dim_suppliers" table in the northwind_dw2 data warehouse.

,supplier_key,supplier_id,company,last_name,first_name,job_title
0,1,1,Supplier A,Andersen,Elizabeth A.,Sales Manager
1,2,2,Supplier B,Weiler,Cornelia,Sales Manager

### 2.0. Create and Populate the New Fact Tables
#### 2.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [16]:
query = {} # Select all elements (columns), and all documents (rows).

collection = "purchase_orders"

df_fact_pos = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_fact_pos.head(2)

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,created_by,submitted_date,creation_date,po_detail_date_received,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,approved_date,submitted_by
0,90,1,1,59.0,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,2006-01-22 00:00:00,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2
1,90,1,34,60.0,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,2006-01-22 00:00:00,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2

In [17]:
# TODO: Extract data for your new "Inventory Transactions" Fact Table

,inventory_transaction_id,inventory_transaction_type,transaction_created_date,transaction_modified_date,product_id,quantity,purchase_order_id,customer_order_id
0,35,Purchased,2006-03-22 16:02:28,2006-03-22 16:02:28,80,75,None,None
1,36,Purchased,2006-03-22 16:02:48,2006-03-22 16:02:48,72,40,None,None

#### 2.2. Lookup the DateKeys from the Date Dimension Table.
**2.2.1.** For each date typed column in the **purchase orders** fact table, lookup the corresponding Surrogate Primary Key column. Be certain to cast the date typed column to the **datetime64[ns]** data type using the **.astype()** function that is native to Pandas DataFrame columns. Also, extract the **date** portion using the **.dt.date** attribute of the **datetime64[ns]** datatype.

In [18]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "submitted_date" Column.
df_dim_submitted_date = df_dim_date.rename(columns={"date_key" : "submitted_date_key", "full_date" : "submitted_date"})
df_fact_pos.submitted_date = df_fact_pos.submitted_date.astype('datetime64[ns]').dt.date
df_fact_pos = pd.merge(df_fact_pos, df_dim_submitted_date, on='submitted_date', how='left')
df_fact_pos.drop(['submitted_date'], axis=1, inplace=True)
df_fact_pos.head(2)

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,created_by,creation_date,po_detail_date_received,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,approved_date,submitted_by,submitted_date_key
0,90,1,1,59.0,2.0,2006-01-22 00:00:00,2006-01-22 00:00:00,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114
1,90,1,34,60.0,2.0,2006-01-22 00:00:00,2006-01-22 00:00:00,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114

In [19]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "creation_date" Column.

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,created_by,po_detail_date_received,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,approved_date,submitted_by,submitted_date_key,creation_date_key
0,90,1,1,59.0,2.0,2006-01-22 00:00:00,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114,20060122
1,90,1,34,60.0,2.0,2006-01-22 00:00:00,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114,20060122

In [20]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "po_detail_date_received" Column.

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,created_by,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,approved_date,submitted_by,submitted_date_key,creation_date_key,po_detail_date_received_key
0,90,1,1,59.0,2.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114,20060122,20060122.0
1,90,1,34,60.0,2.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2006-01-22 00:00:00,2,20060114,20060122,20060122.0

In [21]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "approved_date" Column.

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,created_by,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,submitted_by,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key
0,90,1,1,59.0,2.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2,20060114,20060122,20060122.0,20060122.0
1,90,1,34,60.0,2.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2,20060114,20060122,20060122.0,20060122.0

**2.2.2.** Then, for each date typed column in the **inventory transaction** fact table, lookup the corresponding Surrogate Primary Key column. Be certain to cast the date typed column to the **datetime64[ns]** data type using the **.astype()** function, and extract the **date** portion using the **.dt.date** attribute of the **datetime64[ns]** datatype.

In [22]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "transaction_created_date" Column.
df_dim_tran_created_date = df_dim_date.rename(columns={"date_key" : "transaction_created_date_key", "full_date" : "transaction_created_date"})
df_fact_inventory.transaction_created_date = df_fact_inventory.transaction_created_date.astype('datetime64[ns]').dt.date
df_fact_inventory = pd.merge(df_fact_inventory, df_dim_tran_created_date, on='transaction_created_date', how='left')
df_fact_inventory.drop(['transaction_created_date'], axis=1, inplace=True)
df_fact_inventory.head(2)

,inventory_transaction_id,inventory_transaction_type,transaction_modified_date,product_id,quantity,purchase_order_id,customer_order_id,transaction_created_date_key
0,35,Purchased,2006-03-22 16:02:28,80,75,None,None,20060322
1,36,Purchased,2006-03-22 16:02:48,72,40,None,None,20060322

In [23]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "transaction_modified_date" Column.

,inventory_transaction_id,inventory_transaction_type,product_id,quantity,purchase_order_id,customer_order_id,transaction_created_date_key,transaction_modified_date_key
0,35,Purchased,80,75,None,None,20060322,20060322
1,36,Purchased,72,40,None,None,20060322,20060322

#### 2.3. Lookup the Primary Keys from the Dimension Tables
**Foreign key relationships** must be established between each newly-crafted **Fact table** and each related **Dimension table**.

##### 2.3.1. First, fetch the Surrogate Primary Key and the Business Key from each Dimension table.

In [24]:
sql_dim_invoices = "SELECT invoice_key, invoice_id FROM northwind_dw2.dim_invoices;"
df_dim_invoices = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_invoices)
df_dim_invoices.head(2)

   invoice_key  invoice_id
0            1           5
1            2           6

In [25]:
# TODO: Extract the 'primary key' and the 'business key' from your new "dim_suppliers" dimension table

   supplier_key  supplier_id
0             1            1
1             2            2

In [26]:
# TODO: Extract the 'primary key' and the 'business key' from the "dim_employees" dimension table

   employee_key  employee_id
0             1            1
1             2            2

In [27]:
# TODO: Extract the 'primary key' and the 'business key' from the "dim_products" dimension table

   product_key  product_id
0            1           1
1            2           3

##### 2.3.2. Next, use Business Keys to lookup corresponding Surrogate Primary Keys in the Dimension tables
**2.3.2.1. Inventory Fact table.**  The inventory fact table contains a reference to the *dim_products* table by way of the *product_id* column that enables us to lookup the corresponding *product_key*.

In [28]:
# TODO: Merge the "fact_inventory" and "dim_products" dataframes on the 'product_id' to
# get the 'product_key'. Then drop the 'product_id' column and display the results.

,inventory_transaction_id,inventory_transaction_type,quantity,purchase_order_id,customer_order_id,transaction_created_date_key,transaction_modified_date_key,product_key
0,35,Purchased,75,None,None,20060322,20060322,27
1,63,Sold,30,None,None,20060322,20060324,27

In [29]:
# Insert a new 'fact_inventory_transaction_key' column, with an ever-incrementing numeric value,
# to serve as the surrogate primary key. Then display the results.

,fact_inventory_transaction_key,inventory_transaction_id,inventory_transaction_type,quantity,purchase_order_id,customer_order_id,transaction_created_date_key,transaction_modified_date_key,product_key
0,1,35,Purchased,75,None,None,20060322,20060322,27
1,2,63,Sold,30,None,None,20060322,20060324,27

**2.3.2.2. Purchase Order Fact table**. Here we see another example of a **role-playing dimension**; the *Employee* dimension. The employee dimension is another classic example of a Role-Playing dimension. In-and-of themselves Employees are generic; however, when applied to specific roles they take on the identity of those positions (roles). Here, the *dim_employee* table takes on the identities of *creator, approver, and submitter* in supplying employee keys to the *dim_fact_pos* table.

We also see an example of where one fact table is referenced by another fact table as if it were a dimension table; i.e., a **fact dimension.** In this instance the purchase orders table *fact_pos* contains a reference to the inventory transaction table *fact_inventory* by way of the *inventory_transaction_id* column, enabling us to lookup the corresponding *fact_inventory_key*.

In [30]:
# Lookup the Surrogate Primary Key (employee_key) that Corresponds to the "created_by" Column.
df_dim_creator = df_dim_employees.rename(columns={"employee_key":"created_by_key", "employee_id":"created_by"})
df_fact_pos = pd.merge(df_fact_pos, df_dim_creator, on='created_by', how='inner')
df_fact_pos.drop(['created_by'], axis=1, inplace=True)
df_fact_pos.head(2)

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,approved_by,submitted_by,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key
0,90,1,1,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2.0,2,20060114,20060122,20060122.0,20060122.0,2
1,90,1,34,60.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2.0,2,20060114,20060122,20060122.0,20060122.0,2

In [31]:
# Lookup the Surrogate Primary Key (employee_key) that Corresponds to the "approved_by" Column.

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_by,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key
0,90,1,1,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,2,20060114,20060122,20060122.0,20060122.0,2,2
1,90,1,34,60.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,2,20060114,20060122,20060122.0,20060122.0,2,2

In [32]:
# Lookup the Surrogate Primary Key (employee_key) that Corresponds to the "submitted_by" Column.

,purchase_order_id,supplier_id,po_detail_product_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key,submitted_by_key
0,90,1,1,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2
1,90,1,34,60.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2

Since the *df_fact_pos* fact table contains references to suppliers and products, lookup the surrogate primary keys from the *dim_suppliers* and *dim_products* tables that correspond to the *supplier_id* and *product_id* columns.

In [33]:
# Lookup the Surrogate Primary Key (supplier_key) that Corresponds to the "supplier_id" Column.

,purchase_order_id,po_detail_product_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key,submitted_by_key,supplier_key
0,90,1,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2,1
1,90,34,60.0,Approved,1,10.0,60.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2,1

In [34]:
# Lookup the Surrogate Primary Key (product_key) that Corresponds to the "po_detail_product_id" Column.
# Remember that you'll first have to rename it to "product_id" in the "df_fact_pos" dataframe.

,purchase_order_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key,submitted_by_key,supplier_key,product_key
0,90,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2,1,1
1,90,NaN,Approved,0,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,NaN,20060122.0,2,2,2,1,1

In [35]:
# Insert a new "fact_purchase_order_key" column, with an ever-incrementing numeric value, 
# to serve as the surrogate primary key. Then display the results.

,fact_purchase_order_key,purchase_order_id,po_detail_inventory_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key,submitted_by_key,supplier_key,product_key
0,1,90,59.0,Approved,1,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2,1,1
1,2,90,NaN,Approved,0,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,NaN,20060122.0,2,2,2,1,1

Since the purchase orders table *fact_pos* contains a reference to the inventory transaction table *fact_inventory* by way of the *inventory_transaction_id* column, we can lookup the corresponding *fact_inventory_transaction_key*. In this case, the *fact_inventory* table plays the role of a dimension table. This is called a **fact dimension**.

In [36]:
# The inventory fact table acts as a Fact Dimension: po_detail_inventory_id
df_dim_fact_inventory = df_fact_inventory[['fact_inventory_transaction_key','inventory_transaction_id']]
df_fact_pos.rename(columns={"po_detail_inventory_id":"inventory_transaction_id"}, inplace=True)
df_fact_pos = pd.merge(df_fact_pos, df_dim_fact_inventory, on='inventory_transaction_id', how='left')
df_fact_pos.drop(['inventory_transaction_id'], axis=1, inplace=True)
df_fact_pos.head(2)

,fact_purchase_order_key,purchase_order_id,purchase_order_status,po_detail_posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount,submitted_date_key,creation_date_key,po_detail_date_received_key,approved_date_key,created_by_key,approved_by_key,submitted_by_key,supplier_key,product_key,fact_inventory_transaction_key
0,1,90,Approved,1,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,20060122.0,20060122.0,2,2,2,1,1,77.0
1,2,90,Approved,0,14.0,40.0,0.0,0.0,None,0.0,20060114,20060122,NaN,20060122.0,2,2,2,1,1,NaN

#### 2.4. Perform Any Necessary Transformations to the DataFrames

In [37]:
# Rename the Foreign Key Columns
column_name_map = {"transaction_created_date_key" : "created_date_key",
                   "transaction_modified_date_key" : "modified_date_key",
                  }

df_fact_inventory.rename(columns=column_name_map, inplace=True)

# Reorder the Columns
ordered_columns = ['fact_inventory_transaction_key','inventory_transaction_id'
                   ,'inventory_transaction_type','product_key'
                   ,'created_date_key','modified_date_key','quantity']

df_fact_inventory = df_fact_inventory[ordered_columns]
df_fact_inventory.head(2)

,fact_inventory_transaction_key,inventory_transaction_id,inventory_transaction_type,product_key,created_date_key,modified_date_key,quantity
0,1,35,Purchased,27,20060322,20060322,75
1,2,63,Sold,27,20060322,20060324,30

In [38]:
# Change the 'po_detail_posted_to_inventory' column values from 1 and 0 to 'True' and 'False'.
df_fact_pos['posted_to_inventory'] = df_fact_pos.po_detail_posted_to_inventory.map({1 :'True', 0 :'False'})
df_fact_pos.drop('po_detail_posted_to_inventory', axis=1, inplace=True)
df_fact_pos.rename(columns={'posted_to_inventory' : 'po_detail_posted_to_inventory'}, inplace=True)

# Reorder the Columns
reordered_columns = ['fact_purchase_order_key','purchase_order_id','supplier_key','product_key'
                     ,'fact_inventory_transaction_key','created_by_key','creation_date_key'
                     ,'submitted_by_key','submitted_date_key','approved_by_key','approved_date_key'
                     ,'purchase_order_status','po_detail_date_received_key'
                     ,'po_detail_posted_to_inventory','po_detail_unit_cost','po_detail_quantity'
                     ,'shipping_fee','taxes','payment_date','payment_amount']

df_fact_pos = df_fact_pos[reordered_columns]
df_fact_pos.head(2)

,fact_purchase_order_key,purchase_order_id,supplier_key,product_key,fact_inventory_transaction_key,created_by_key,creation_date_key,submitted_by_key,submitted_date_key,approved_by_key,approved_date_key,po_detail_date_received_key,purchase_order_status,posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount
0,1,90,1,1,77.0,2,20060122,2,20060114,2,20060122.0,20060122.0,Approved,True,14.0,40.0,0.0,0.0,None,0.0
1,2,90,1,1,NaN,2,20060122,2,20060114,2,20060122.0,NaN,Approved,False,14.0,40.0,0.0,0.0,None,0.0

#### 2.5. Load Newly Transformed MongoDB Data into the Northwind_DW2 Data Warehouse

In [39]:
dataframe = df_fact_pos
table_name = 'fact_purchase_orders'
primary_key = 'fact_purchase_order_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [40]:
# TODO: Upload the "Inventory Transaction" dataframe to create the new "fact_inventory_transactions" fact table.

#### 2.6. Validate that the New Fact Tables were Created

In [41]:
sql_purchase_orders = "SELECT * FROM northwind_dw2.fact_purchase_orders;"
df_fact_purchase_orders = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_purchase_orders)
df_fact_purchase_orders.head(2)

,fact_purchase_order_key,purchase_order_id,supplier_key,product_key,fact_inventory_transaction_key,created_by_key,creation_date_key,submitted_by_key,submitted_date_key,approved_by_key,approved_date_key,po_detail_date_received_key,purchase_order_status,posted_to_inventory,po_detail_unit_cost,po_detail_quantity,shipping_fee,taxes,payment_date,payment_amount
0,1,90,1,1,77.0,2,20060122,2,20060114,2,20060122.0,20060122.0,Approved,True,14.0,40.0,0.0,0.0,None,0.0
1,2,90,1,1,NaN,2,20060122,2,20060114,2,20060122.0,NaN,Approved,False,14.0,40.0,0.0,0.0,None,0.0

In [42]:
# TODO: Validate the correctness of the new "Inventory Transactions" fact table.

,fact_inventory_transaction_key,inventory_transaction_id,inventory_transaction_type,product_key,created_date_key,modified_date_key,quantity
0,1,35,Purchased,27,20060322,20060322,75
1,2,63,Sold,27,20060322,20060324,30

### 3.0. Demonstrate that the New Data Warehouse Exists and Contains the Correct Data
To demonstrate the viability of your solution, author a SQL SELECT statement that returns:
- Each Company’s Name
- The total amount of the purchase order detail quantity associated with each company
- The total amount of the purchase order detail unit cost associated with each company

**NOTE:** *Remember that a string typed variable whose value is contained by triple-quotes (""" ... """) can preserve multi-line formatting, and that a string variable has an intrinsic **.format()** function that accepts ordered parameters that will replace tokens (e.g., {0}) in the formatted string.*

In [ ]:
sql_purchase_orders = """
    
"""

In [ ]:
df_fact_purchase_orders = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_purchase_orders)
df_fact_purchase_orders

### 3.1 Extra Credit: Author a Query that Returns the Inventory Transaction Data
- Each Product Category
- Each TransactionType
- The total number of transactions associated with each Product Category and Transaction Type
- The total amount (quantity) associated with each Product Category and Transaction Type

In [ ]:
sql_inventory_transactions = """

"""

In [ ]:
df_fact_inventory_transactions = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_inventory_transactions)
df_fact_inventory_transactions